Repository: DarkDare/sauvegarde
Catalog: po/*.po
Languages: fr

source: Elapsed time (%s): %d
fr: Temps écoulé (%s) : %d

source: Answer is: "%s"
fr: La réponse est : "%s"

source: Error while sending GET command and receiving data: %s
fr: Erreur lors de l'envoie de la commande GET et de la réception des données : %s

source: Error while sending POST command (to "%s"): %s
fr: Erreur lors de l'envoi de la commande POST (à "%s") : %s

source: Error while looking for %s key in configuration file: %s
fr: Erreur lors de la recherche de la clef %s dans le fichier de configuration : %s

source: Could not load debug mode configuration from file.
fr: Impossible de charger le mode de débogage depuis le fichier de configuration.

source: Creating tables into the database
fr: Création des tables dans la base de données

source: (%d) Error while creating database table 'data': %s
fr: (%d) Erreur lors de la création de la table 'data' dans la base de données : %s

source: (%d) Error while creating database table 'buffers': %s
fr: (%d) Erreur lors de la création de la table 'buffers' dans la base de données : %s

source: (%d) Error while creating database table 'files': %s
fr: (%d) Erreur lors de la création de la table 'files' dans la base de données : %s

source: (%d) Error while searching into the table 'files': %s
fr: (%d) Erreur lors de la recherche dans la table 'files' : %s

source: (%d) Error openning the transaction: %s
fr: (%d) Erreur lors de l'ouverture de la transaction : %s

source: (%d) Error while inserting into the table 'files': %s
fr: (%d) Erreur lors de l'insertion dans la table 'files' : %s

source: (%d) Error commiting to the database: %s
fr: (%d) Erreur lors du "commit" dans la base de donnée : %s

source: (%d) Error while trying to open %s database: %s
fr: (%d) Erreur lors de l'ouverture de la base de données %s : %s

source: Setting mode: %d
fr: Fixe le mode : %d

source: Error while getting file information: %s
fr: Erreur lors de la récupération des informations du fichier : %s

source: Error or warning for file (%s): %s
fr: Erreur ou avertissement pour le fichier (%s) : %s

source: Error: unable to create symbolic link %s to %s: %s.
fr: Erreur : Impossible de créé un lien symbolique de %s vers %s : %s.

source: Debug mode is disabled.
fr: Mode de débogage désactivé.

source: Debug mode is activated.
fr: Mode de débogage activé.

source: %s was compiled with the following libraries: . GLIB version: %d.%d.%d
fr: %s a été compilé avec les librairies suivantes : . GLIB version : %d.%d.%d

source: %s version: %s-%s (%s) Author(s): %s License: %s
fr: %s version : %s-%s (%s) Auteur(s) : %s Licence : %s

source: Gettext package: %s
fr: Paquet gettext : %s

source: Text domain: %s
fr: Domaine du texte : %s

source: g_thread_create failed !
fr: g_thread_create a échoué !

source: Failed to install SIGPIPE handler: %s
fr: Impossible d'installer la fonction pour traiter le signal SIGPIPE : %s

source: Error while converting to JSON
fr: Erreur lors de la conversion à JSON

source: Error while converting to JSON from keyname %s
fr: Erreur lors de la conversion de la clef %s à JSON

source: Error while trying to load JSON: %s line: %d, column: %d, position: %d, string: %s
fr: Erreur lors de la tentative de chargement JSON : %s ligne : %d, colonne : %d, position : %d, chaîne : %s

source: Something is wrong with lengths: data_len = %ld, read = %ld, hash_len = %ld, HASH_LEN = %ld
fr: Quelque chose est erroné dans les longueurs : data_len = %ld, read = %ld, hash_len = %ld, HASH_LEN = %ld

source: Couldn't block signals: %s
fr: Impossible de bloquer les signaux : %s

source: Couldn't setup signal FD: %s
fr: Impossible de configurer le signal FD : %s

source: Couldn't setup new fanotify device: %s
fr: Impossible de configurer un nouveau périphérique fanotify : %s

source: Couldn't add monitor in directory %s: %s
fr: Impossible d'ajouter un surveillant au dossier %s : %s

source: Started monitoring directory %s
fr: Démarrage de la surveillance du dossier %s

source: Invalid file descriptor: %d
fr: Descripteur de fichier invalide : %d

source: 'readlink' error: %s
fr: Erreur 'readlink' : %s

source: Unable to get meta data for file %s: %s
fr: Impossible de récupérer les méta-données pour le fichier %s : %s

source: Received event file/directory: %s
fr: Réception d'un événement fichier/dossier : %s

source: matching directory is: %s
fr: le dossier correspondant est : %s

source: Couldn't poll(): '%s'
fr: Impossible d'exécuter poll() : '%s'

source: Couldn't read signal, wrong size read
fr: Impossible de lire le signal, mauvaise taille lue

source: Received unexpected signal
fr: Réception d'un signal inattendu

source: Please wait while initializing main structure...
fr: Merci de patienter pendant l'initialisation de la structure principale...

source: Main structure initialized !
fr: Structure principale initialisée !

source: Error while reading file: %s
fr: Erreur en lisant le fichier : %s

source: Unable to open file for reading: %s
fr: Impossible d'ouvrir le fichier pour y lire : %s

source: Sending meta data: %s
fr: Envoi des méta données : %s

source: Error while loading JSON answer from serveur
fr: Erreur en chargant le JSON de la réponse du serveur

source: Error while loading JSON answer from server
fr: Erreur en chargeant le JSON de la réponse du serveur

source: Processing file: %s
fr: Traitement du fichier %s

source: Sending data: %d bytes
fr: Envoi des données : %d octets

source: processing file %s
fr: Traitement du fichier %s

source: Unable to enumerate directory %s: %s
fr: Impossible d'énumérer le dossier %s : %s

source: GPL v3 or later
fr: GPL v3 ou plus récente.

source: %s options are:
fr: Les options de %s sont :

source: Directory list:
fr: Liste des dossiers :

source: Blocksize: %s
fr: Taille du bloc : %s

source: Blocksize: adaptative mode
fr: Taille du bloc : mode adaptatif

source: Configuration file: %s
fr: Fichier de configuration : %s

source: Cache directory: %s
fr: Dossier de cache : %s

source: Cache database name: %s
fr: Nom de la base de données dans le cache : %s

source: Server's IP address: %s
fr: Adresse IP du serveur : %s

source: Server's port number: %d
fr: Numéro du port du serveur : %d

source: Buffersize: %d
fr: Taille du cache : %d

source: Could not load directory list from file
fr: Impossible de charger la liste des dossiers depuis le fichier

source: Could not load blocksize from file
fr: Impossible de charger la taille du bloc depuis le fichier

source: Could not load directory name
fr: Impossible de charger le nom du dossier

source: Could not load cache database name
fr: Impossible de charger le nom de la base de données dans le cache

source: Could not load adaptative configuration from file.
fr: Impossible de charger la valeur de l'option "adaptative" depuis le fichier de configuration.

source: Could not load buffersize from file
fr: Impossible de charger la taille du cache depuis le fichier

source: Could not load serveur port number from file.
fr: Impossible de charger le numéro du port du serveur depuis le fichier.

source: Reading configuration from file %s
fr: Lecture de la configuration depuis le fichier %s

source: Failed to open %s configuration file: %s
fr: Impossible d'ouvrir le fichier de configuration %s : %s

source: Prints program version
fr: Affiche la version du programme.

source: Activates (1) or desactivates (0) debug mode.
fr: Active (1) ou désactive (0) le mode de débogage.

source: BOOLEAN
fr: BOOLÉEN

source: Specify an alternative configuration file.
fr: Spécifie un fichier de configuration alternatif.

source: FILENAME
fr: NOM DU FICHIER

source: Fixed block SIZE used to compute hashs.
fr: TAILLE fixe des blocs pour le calcul des sommes de contrôle.

source: SIZE
fr: TAILLE

source: Adapative block size used to compute hashs.
fr: Taille des blocs adaptative pour le calcul des sommes de contrôle.

source: SIZE of the cache used to send data to server.
fr: Taille du cache utilisé pour envoyer les données au serveur.

source: Directory DIRNAME where to cache files.
fr: Répertoire NOM DU RÉPERTOIRE du cache des fichiers.

source: DIRNAME
fr: NOM DU RÉPERTOIRE

source: Database FILENAME.
fr: NOM DU FICHIER de la base de données.

source: IP address where server program is.
fr: Adresse IP du serveur.

source: Port NUMBER on which to listen.
fr: NUMÉRO du port à écouter.

source: NUMBER
fr: NUMÉRO

source: Please report bugs to:
fr: Indiquez les bugs à :

source: This program is monitoring file changes in the filesystem and is hashing files with SHA256 algorithms from Glib.
fr: Ce programme surveille les fichiers qui changent dans le système de fichiers et fait ses sommes de contrôle (hashs) avec l'algorithme SHA256 de la librairie Glib.

source: Option parsing failed: %s
fr: Analyse des options échouée : %s

source: serveur's IP address: %s
fr: Adresse IP du serveur : %s

source: serveur's port number: %d
fr: Numéro du port du serveur : %d

source: Could not load server port number from file.
fr: Impossible de charger le numéro du port du serveur depuis le fichier.

source: Prints program version.
fr: Affiche la version du programme.

source: Gives a list of saved files that correspond to the given REGEX.
fr: Donne la liste des fichiers sauvegardés correspondants à l'EXPRESSION RATIONNELLE.

source: Restore requested filename (REGEX) (by default latest version).
fr: Restaure le fichier demandé (EXPRESSION RATIONNELLE) (par défaut la dernière version).

source: restores the selected file at that specific DATE.
fr: Restaure le fichier sélectionné à une DATE spécifique.

source: Specify a DIRECTORY where to restore a file.
fr: Indique un RÉPERTOIRE où restaurer un fichier.

source: DIRECTORY
fr: RÉPERTOIRE

source: Port NUMBER on which server program is listening.
fr: NUMÉRO du port sur lequel le programme serveur est à l'écoute.

source: This program is restoring files from cdpfglserver's server.
fr: Ce programme restaure les fichiers depuis le serveur cdpfglserver.

source: hostname: %s, uid: %s, gid: %s, owner: %s, group: %s
fr: hostname : %s, uid : %s, gid : %s, propriétaire : %s, groupe : %s

source: Query is: %s
fr: La requête est : %s

source: Error while trying to restore %s hash
fr: Erreur lors de la restauration du hash %s

source: Error while getting hash %s
fr: Erreur lors de la récupération du hash %s

source: filename to restore: %s
fr: Fichier à restaurer : %s

source: Error: unable to open file %s to write data in it (%s).
fr: Erreur : Impossible d'ouvrir le fichier %s pour y écrire des données (%s).

source: File to be restored: type %d, inode: %ld, mode: %d, atime: %ld, ctime: %ld, mtime: %ld, size: %ld, filename: %s, owner: %s, group: %s, uid: %d, gid: %d
fr: Fichiers à restaurer : type %d, inode: %ld, mode : %d, atime : %ld, ctime : %ld, mtime : %ld, size : %ld, filename : %s, owner : %s, group : %s, uid : %d, gid : %d

source: Error: unable to write to file %s (%ld bytes written).
fr: Erreur : Impossible d'écrire dans le fichier %s (%ld octets écrits).

source: Error: unable to open file %s to append meta-data in it.
fr: Erreur : Impossible d'ouvrir le fichier %s pour y ajouter des méta-données.

source: Error: no serveur_meta_data_t structure or missing hostname or missing meta_data_t * structure.
fr: Erreur : pas de structure server_meta_data_t ou nom de l'hôte manquant ou structure meta_data_t manquante.

source: Error: unable to open file %s to write data in it.
fr: Erreur impossible d'ouvrir le fichier %s pour y écrire des données.

source: Error: no hash_data_t structure or hash in it or missing data in it.
fr: Erreur : pas de structure hash_data_t ou hash ou données manquants à l'intérieur.

source: Could not load [file_backend] file-directory from file.
fr: Impossible de charger l'option [file_backend] file-directory depuis le fichier.

source: Could not load [file_backend] dir-level from file.
fr: Impossible de charger l'option [file_backend] dir-level depuis le fichier.

source: Please wait while creating directories
fr: Merci de patientez pendant la création des dossiers

source: Finished !
fr: Fini !

source: Error: no serveur structure or no backend structure.
fr: Erreur : aucune structure serveur ou aucune structure de backend.

source: Error while reading the file: %s
fr: Erreur en lisant le fichier : %s

source: file_backend: Found: type %d, inode: %ld, mode: %d, atime: %ld, ctime: %ld, mtime: %ld, size: %ld, filename: %s, owner: %s, group: %s, uid: %d, gid: %d, link: %s
fr: file_backend : Trouvé : type %d, inode : %ld, mode : %d, atime : %ld, ctime : %ld, mtime : %ld, size : %ld, filename : %s, owner : %s, group : %s, uid : %d, gid : %d, link : %s

source: file_backend: filter is: %s && %s
fr: file_backend : le filtre est : %s && %s

source: Error: unable to open file %s to read data from it.
fr: Erreur impossible d'ouvrir le fichier %s pour y lire des données.

source: file_backend: Something is wrong with backend initialization!
fr: file_backend : Quelque chose ne va pas avec l'initialisation du backend !

source: file_backend: path: %s, filename: %s
fr: file_backend : chemin : %s, nom du fichier : %s

source: Error: unable to read from file %s (%ld bytes read): %s.
fr: Erreur : impossible de lire depuis le fichier %s (%ld octets lus) : %s.

source: Port number: %d
fr: Numéro du port : %d

source: %s options are: Configuration file: %s
fr: Les options de %s sont : Fichier de configuration : %s

source: %sPort number: %d
fr: %sNuméro du port : %d

source: [%s, %d] Option parsing failed: %s
fr: [%s, %d] Analyse des options échouée : %s

source: MHD daemon stopped.
fr: démon MHD arrêté.

source: backend variable freed.
fr: variable 'backend' libérée

source: data thread unrefed.
fr: thread 'data' déréférencé.

source: meta thread unrefed.
fr: thread 'meta' déréférencé.

source: option structure freed.
fr: structure 'option' libérée.

source: main structure freed.
fr: Structure principale libérée.

source: Ending the program:
fr: Terminaison du programme :

source: Main loop exited.
fr: boucle principale terminée.

source: This backend's missing a retrieve_data function!
fr: Il manque une fonction de récupération des données (retrieve_data) à ce backend !

source: Something's wrong with server's initialisation!
fr: Quelque chose ne va pas avec l'initialisation du serveur !

source: Malformed request. hostname: %s, uid: %s, gid: %s, owner: %s, group: %s
fr: Requête mal formée. hostname : %s, uid : %s, gid : %s, owner : %s, group : %s

source: Trying to get data for hash %s
fr: Essai de récupération des données pour le hash %s

source: Error: invalid url: %s
fr: Erreur : URL invalide : %s

source: Requested get url: %s
fr: URL requise (get) : %s

source: Received meta data (%zd bytes) for file %s
fr: Méta données reçues (%zd octets) pour le fichier %s

source: Error: could not convert json to metadata
fr: Erreur : impossible de convertir json en méta-données

source: Received data for hash: "%s" (%ld bytes)
fr: Réception des données pour le hash : "%s" (%ld octets)

source: Error: invalid url!
fr: Erreur : URL invalide !

source: Could not guess Content-Length header value: %s
fr: Impossible de deviner la valeur de l'entête Content-Length : %s

source: Headers for this connection are:
fr: Les en-têtes de cette connexion sont :

source: Error: received a NULL pointer.
fr: Erreur : réception d'un pointeur NULL.

source: Error: no meta data store backend defined, meta-data's thread terminating...
fr: Erreur : pas de backend défini pour stocker les méta-données, le thread des méta-données se termine...

source: Error: unable to launch meta-data thread.
fr: Erreur : impossible de démarrer le thread des méta-données.

source: Error: no data store backend defined, data's thread terminating...
fr: Erreur : pas de backend pour stocker les données, le thread des données se termine...

source: Error while trying to launch data thread
fr: Erreur lors du lancement du thread des données.

source: Unable to add signal handler
fr: Impossible d'ajouter une fonction pour traiter les signaux

source: Error while spawning libmicrohttpd daemon
fr: Erreur lors de l'exécution du daemon libmicrohttpd

source: Error: initialization failed.
fr: Erreur : initialisation échouée.

source: Error while compiling %s to a regular expression: %s
fr: Erreur lors de la compilation de %s en une expression rationnelle : %s

source: processing excluded file
fr: Traitement du fichier exclu

source: We have data and meta data to transmit to server
fr: Il y a des données et des métas-données à transmettre au serveur

source: Exclude list:
fr: Liste d'exclusion :

source: Could not load exclude file list from file
fr: Impossible de charger la liste des dossiers depuis le fichier

source: Exclude FILENAME from being saved.
fr: Exclu FICHIER de la sauvegarde.

source: (%d) Error while creating database table 'transmited': %s
fr: (%d) Erreur lors de la création de la table 'transmited' dans la base de données : %s

source: (%d) Error while inserting into the table 'buffers': %s
fr: (%d) Erreur lors de l'insertion dans la table 'buffers' : %s

source: (%d) Error while inserting into the table 'transmited': %s
fr: (%d) Erreur lors de l'insertion dans la table 'transmited' : %s

source: (%d) Error while deleting from table 'buffers': %s
fr: (%d) Erreur lors de la destruction dans la table 'buffers' : %s

source: Something is wrong with lengths: data_len = %s, read = %s, hash_len = %s, HASH_LEN = %d
fr: Quelque chose est erroné dans les longueurs : data_len = %s, read = %s, hash_len = %s, HASH_LEN = %d

source: server's IP address: %s
fr: Adresse IP du serveur : %s

source: server's port number: %d
fr: Numéro du port du serveur : %d

source: File to be restored: type %d, inode: %s, mode: %d, atime: %s, ctime: %s, mtime: %s, size: %s, filename: %s, owner: %s, group: %s, uid: %d, gid: %d
fr: Fichiers à restaurer : type %d, inode: %s, mode : %d, atime : %s, ctime : %s, mtime : %s, size : %s, filename : %s, owner : %s, group : %s, uid : %d, gid : %d

source: Error: unable to write to file %s (%s bytes written).
fr: Erreur : Impossible d'écrire dans le fichier %s (%s octets écrits).

source: Error: no server_meta_data_t structure or missing hostname or missing meta_data_t * structure.
fr: Erreur : pas de structure server_meta_data_t ou nom de l'hôte manquant ou structure meta_data_t manquante.

source: Error: no server structure or no backend structure.
fr: Erreur : aucune structure serveur ou aucune structure de backend.

source: Error: unable to read from file %s (%s bytes read): %s.
fr: Erreur : impossible de lire depuis le fichier %s (%s octets lus) : %s.

source: Received data for hash: "%s" (%s bytes)
fr: Réception des données pour le hash : "%s" (%s octets)
